In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('test.sqlite3')
print(conn)
conn.close()

<sqlite3.Connection object at 0x0000012F0E34C940>

## Creat Table

In [4]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    cursor.execute(
        """ create table student(roll INT, name TEXT, age INT)"""
    )
    conn.commit()

## INSERT

In [5]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    cursor.execute(
        """ INSERT INTO student VALUES(?, ?, ?)""",(101,"Tessa Jhon", 24)
    )
    conn.commit()

## SELECT

In [10]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """ SELECT * FROM student """
    )
    print(list(result))

[(101, 'Tessa Jhon', 24), (102, 'Muasa Fhon', 27), (103, 'Harding Scott', 29), (104, 'Green Stabb', 31), (105, 'Alexa Smith', 27), (106, 'Alley Peri', 29), (107, 'Grish Johnson', 31)]

In [9]:
user = [
    (102,"Muasa Fhon", 27),
    (103,"Harding Scott", 29),
    (104,"Green Stabb", 31),
    (105,"Alexa Smith", 27),
    (106,"Alley Peri", 29),
    (107,"Grish Johnson", 31),
]
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    cursor.executemany(
        """ INSERT INTO student VALUES(?, ?, ?)""", user
    )
    conn.commit()

In [15]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """ SELECT * FROM student """
    )
    print(list(result.fetchone()))

[101, 'Tessa Jhon', 24]

In [18]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """ SELECT * FROM student """
    )
    print(list(result.fetchall()))

[(101, 'Tessa Jhon', 24), (102, 'Muasa Fhon', 27), (103, 'Harding Scott', 29), (104, 'Green Stabb', 31), (105, 'Alexa Smith', 27), (106, 'Alley Peri', 29), (107, 'Grish Johnson', 31)]

## Filtering

In [19]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """ SELECT roll, name FROM student """
    )
    print(list(result.fetchmany(2)))

[(101, 'Tessa Jhon'), (102, 'Muasa Fhon')]

## WHERE CLAUSE

In [30]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """ SELECT * FROM student WHERE age> ? """, (27,)
    )
    print(list(result))

[(103, 'Harding Scott', 29), (104, 'Green Stabb', 31), (106, 'Alley Peri', 29), (107, 'Grish Johnson', 31)]

In [37]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """ SELECT roll, name, age FROM student WHERE age< ? """, (29,)
    )
    print(list(result))

[(101, 'Tessa Jhon', 24), (102, 'Muasa Fhon', 27), (105, 'Alexa Smith', 27)]

## AND, IN, OR, NOT

In [44]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """ SELECT roll, name, age FROM student WHERE age > ? and age< ? """, (24, 29)
    )
    print(list(result))

[(102, 'Muasa Fhon', 27), (105, 'Alexa Smith', 27)]

In [47]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """ SELECT roll, name, age FROM student WHERE NOT age >? """, (25,)
    )
    print(list(result))

[(101, 'Tessa Jhon', 24)]

In [48]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """ SELECT roll, name, age FROM student WHERE age IN (?,?,?)  """, (24,27,28)
    )
    print(list(result))

[(101, 'Tessa Jhon', 24), (102, 'Muasa Fhon', 27), (105, 'Alexa Smith', 27)]

In [50]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """ SELECT roll, name, age FROM student WHERE name LIKE 'a%' """, 
    )
    print(list(result))

[(105, 'Alexa Smith', 27), (106, 'Alley Peri', 29)]

In [52]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """  SELECT roll, name, age FROM student WHERE name LIKE '%a%' """, 
    )
    print(list(result))

[(101, 'Tessa Jhon', 24), (102, 'Muasa Fhon', 27), (103, 'Harding Scott', 29), (104, 'Green Stabb', 31), (105, 'Alexa Smith', 27), (106, 'Alley Peri', 29)]

In [53]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """  SELECT roll, name, age FROM student WHERE name LIKE '_l%' """, 
    )
    print(list(result))

[(105, 'Alexa Smith', 27), (106, 'Alley Peri', 29)]

## Aggregate Function

In [57]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """  SELECT MAX(age), AVG(age), SUM(age), COUNT(*) FROM student """, 
    )
    print(list(result))

[(31, 28.285714285714285, 198, 7)]

## GROUP BY

In [61]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """  SELECT  count(age) FROM student GROUP BY age """, 
    )
    print(list(result))

[(1,), (2,), (2,), (2,)]

In [65]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """  SELECT * FROM student ORDER BY age DESC""", 
    )
    for roll, name, age in result:
        print(roll,name,age)

104 Green Stabb 31
107 Grish Johnson 31
103 Harding Scott 29
106 Alley Peri 29
102 Muasa Fhon 27
105 Alexa Smith 27
101 Tessa Jhon 24

## Updating Data

In [68]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    cursor.execute(
        """ UPDATE student SET age =? WHERE roll = ? """, (26,101)
    )

    result = cursor.execute(
        """  SELECT * FROM student ORDER BY age """, 
    )
    for roll, name, age in result:
        print(roll,name,age)

101 Tessa Jhon 26
102 Muasa Fhon 27
105 Alexa Smith 27
103 Harding Scott 29
106 Alley Peri 29
104 Green Stabb 31
107 Grish Johnson 31

## DELETE

In [70]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
    cursor.execute(
        """ DELETE from student WHERE roll = ? """, (101,)
    )

    result = cursor.execute(
        """  SELECT * FROM student ORDER BY age """, 
    )
    for roll, name, age in result:
        print(roll,name,age)

102 Muasa Fhon 27
105 Alexa Smith 27
103 Harding Scott 29
106 Alley Peri 29
104 Green Stabb 31
107 Grish Johnson 31

## DROP TABLE

In [72]:
with sqlite3.connect('test.sqlite3') as conn:
    cursor = conn.cursor()
   # cursor.execute(
       # """ DROP TABLE student """,       
    #)

    result = cursor.execute(
        """  SELECT * FROM student ORDER BY age """, 
    )
    for roll, name, age in result:
        print(roll,name,)

102 Muasa Fhon
105 Alexa Smith
103 Harding Scott
106 Alley Peri
104 Green Stabb
107 Grish Johnson